// Keys should contain same arguments as values
"adSizes_undefined"="adSize or adSizes is UNDEFINED.";
"fetcher_stopped"="AdFetcher stopped";
"no_placement_id"="E104: No placement ID set. onAdRequestFailed will not be called";
"already_expanded"="Cannot load a new ad while the current ad is expanded. onAdRequestFailed will not be called";
"moot_restart"="AdFetcher requested to start, but tasker already instantiated";
"fetcher_start"="AdFetcher starting";
"fetcher_start_single"="AdFetcher starting in single-use mode";
"fetcher_start_auto"="AdFetcher started in auto-refresh mode";
"permissions_missing_location"="E100: Location permissions ACCESS_COARSE_LOCATION and/or ACCESS_FINE_LOCATION aren't set in the host app. This may affect demand.";
"response_error \(error)"="E301: The server replied with an error: \(error)";
"response_no_ads"="The server responded, but didn't return any ads.";
"response_json_error \(error)"="E300: There was an error parsing the JSON response: \(error)";
"response_bad_format"="The server responded with ads, but in an unexpected format.";

"adsize_too_big"="E103: You requested an Ad larger than the measured ad space. Ad space size: %dx%d, request size: %dx%d";
"blank_ad"="E302: The server returned an ad with the response, but it was blank. There is probably an issue with the creative.";
"opening_url_failed %@"="Failed to launch custom protocol: %@";
"mediation_instantiation_failure %@"="Instantiating mediated ad failed due to %@";
"mediation_adding_invalid %@"="Adding %@ to invalid networks list";
"mediation_adding_invalid_for_media_type %@ %@"="Adding %@ to %@ invalid networks list";
"instantiating_class %@"="Instantiating %@";
"instance_exception %@"="MediatedAdView is null or not an instance of %@";
"mediation_finish"="Mediation Controller has finished.";
"request_parameter_override_attempt %@"="Parameter %@ cannot be overridden by custom keywords";
"mediation_timeout"="Mediation network timed out.";
"bad_url_connection"="Unable to make request because of a bad URL connection.";
"malformed_url"="Unable to make request because of a malformed URL.";
"ad_request_failed %@%@"="Ad request %@ failed with error %@";
"multi_ad_request_failed %@%@"="Multi ad request %@ FAILED with error %@";
"connection_failed %d"="Ad request connection failed with status code %d";
"no_ad_received_error %@"="No ad received. Error: %@";
"response_received %@"="Received ad server response: %@";
"response_received_unknown"="Received response from unknown";
"native_request_invalid_response"="Expected a NativeMediatedAdResponse.";
"native_invalid_view"="A valid view is required for native ad response registration.";
"native_invalid_rvc"="A valid root view controller is required for native ad response registration.";
"native_expired_response"="The native Ad is expired, cannot use it for tracking";
"native_ad_registered_for_tracking"="The native response is already registered for tracking";
"native_adapter_missing_methods"="Mediated SDK adapter must implement registerViewForImpressionTrackingAndClickHandling:withRootViewController:clickableViews: or registerViewForImpressionTracking:";
"native_adapter_error"="Could not register with mediated SDK adapter, it does not implement the required methods.";
"native_adapter_native_ad_delegate_missing"="The native mediated adapter has not synthesized the NativeAdResponseDelegate property";
"native_invalid_clickable_views"="A non-view object was passed in clickableViews. Ignoring.";
"ad_network_error"="The ad request failed due to a network error";
"ad_request_too_frequent_error"="Called loadAd too many times";
"ad_display_format_mismatch_error"="Display format in the ad request does not match the display format specified for this placement";
"sdk_version_unsupported_error"="The SDK version in the ad request is no longer supported";
"invalid_request_error"="The ad request failed due to an invalid configuration (for example, size or placement ID not set)";
"ad_server_error"="The ad request failed due to a server error";
"ad_internal_error"="The ad request failed due to a internal error";
"lazy_ad_load_failed %@"="Lazy ad load FAILED TO INSTANTIATE WEBVIEW.  (AdResponseCode: %@";
